src/CFD/heatedplate6.3.2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0    0 -90)   // 0
    (200  0 -90)   // 1
    (200 45 -90)   // 2
    (0   45 -90)   // 3
    (0    0   0)   // 4
    (200  0   0)   // 5
    (200 45   0)   // 6
    (0   45   0)   // 7

    (250  0 -90)   // 8
    (250 45 -90)   // 9
    (250  0   0)   // 10
    (250  45  0)   // 11

    (450   0 -90)  // 12
    (450  45 -90)  // 13
    (450   0   0)  // 14
    (450  45   0)  // 15

    (200  0 -30)   // 16
    (200 45 -30)   // 17

    (200  0 -60)   // 18
    (200 45 -60)   // 19

    (250  0 -30)   // 20
    (250 45 -30)   // 21

    (250  0 -60)   // 22
    (250 45 -60)   // 23

    (0    0 -60)   // 24
    (0   45 -60)   // 25
    (0    0 -30)   // 26
    (0   45 -30)   // 27

    (450   0 -60)  // 28
    (450  45 -60)  // 29
    (450   0 -30)  // 30
    (450  45 -30)  // 31
);

blocks
(
    hex ( 0  1  2  3 24 18 19 25) (40 10 10) simpleGrading (1 1 1)
    hex (24 18 19 25 26 16 17 27) (40 10 10) simpleGrading (1 1 1)
    hex (26 16 17 27  4  5  6  7) (40 10 10) simpleGrading (1 1 1)

    hex ( 1  8  9  2 18 22 23 19) (10 10 10) simpleGrading (1 1 1)
    hex (18 22 23 19 16 20 21 17) (10 10 10) simpleGrading (1 1 1)
    hex (16 20 21 17  5 10 11  6) (10 10 10) simpleGrading (1 1 1)

    hex ( 8 12 13  9 22 28 29 23) (40 10 10) simpleGrading (1 1 1)
    hex (22 28 29 23 20 30 31 21) (40 10 10) simpleGrading (1 1 1)
    hex (20 30 31 21 10 14 15 11) (40 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type wall;
        faces
        (
            ( 3 25 19  2)
            (25 27 17 19)
            (27  7  6 17)

            ( 2 19 23  9)
            (19 17 21 23)
            (17  6 11 21)

            ( 9 23 29 13)
            (23 21 31 29)
            (21 11 15 31)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            ( 1 18 24  0)
            (18 16 26 24)
            (16  5  4 26)

            ( 8 22 18  1)
            (20 10  5 16)

            (12 28 22  8)
            (28 30 20 22)
            (30 14 10 20)
        );
    }
    heatedWall
    {
        type wall;
        faces
        (
            (22 20 16 18)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            ( 0 24 25  3)
            (24 26 27 25)
            (26  4  7 27)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 29 28 12)
            (29 31 30 28)
            (31 15 14 30)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  3  2  1)
            ( 4  5  6  7)

            ( 1  2  9  8)
            ( 5 10 11  6)

            ( 8  9 13 12)
            (10 14 15 11)
        );
    }
);

// ************************************************************************* //
